
/*Удалили два объекта */
db["120925_Honcharov_pr"].deleteMany({"name": {$in: ["Mars", "Neptune"]}})
/*---------------------------------------------------------------------*/

/* Увеличить температуру на 10% */
db["120925_Honcharov_pr"].updateMany({}, {$mul: {surfaceTemperature: 1.1}})
/*---------------------------------------------------------------------*/
db["120925_Honcharov_pr"].update({name: "Neptune"}, 
                                {$set: {"orderFromSun": 8}})
/*---------------------------------------------------------------------*/
db["120925_Honcharov_pr"].update({name: "Neptune"}, 
                                {$set: {"orderFromSun": 8}})
/*---------------------------------------------------------------------*/
db["120925_Honcharov_pr"].update({name: "Neptune"}, 
                                {$set: {"orderFromSun": 8}})
/*---------------------------------------------------------------------*/